const React = require('react');

class APPagreement extends React.Component {

    render() {
        return (
            <div className="app_text">
                <h2>龙岗区政务数据资源网《APP应用提交协议》</h2>
                <p>我司平台为政务公开相关服务，为符合<br></br>要求的APP应用提供公开平台，需要满足以下要求，通过审核，方能公布到网站，供广大市民下载使用：</p>
                <p>1、所申请APP应用版权需为个人/贵公司所以，不得申请他人版权的APP；</p>
                <p>2、APP不存在恶意收费、盗取用户账号信息等违规行为；</p>
                <p>3、用户在发布其APP应用之前，本网站有权对该应用予以审核，决定是否同意发布该应用。APP应用发布后，本网站如发现其违反该服务条款或任何相关法律、法规，有权在不通知的情况下对其予以删除或屏蔽。</p>
                <p>4、现阶段，用户有权免费获取本网站所提供的所有政务数据资源，享有数据资源的非排他使用权。用户不得有偿或无偿转让在本网站中获取的各种数据资源。</p>
                <p>5、用户应在应用本网站政务数据资源所产生的成果中注明政务数据资源来源为"北京市政务数据资源网"，及时将应用情况通过网站进行备案，并应积极配合有关的用户需求调查和数据资源调查。</p>
                <p>6、用户在发布基于本网站获取的政务数据资源开发的APP应用时，应确保其发布内容不会侵犯任何第三方的合法权益（包括但不限于著作权、商标权、专利权等），不会违反任何法律、法规、条例或规章，如造成法律纠纷及事故，由用户承担相应法律责任。</p>
                <p>7、本网站包含的所有内容（包括但不限于：文本、图形、图片、视像及声音内容、LOGO标识，版面设计，专栏目录与名称、内容分类）的所有权归北京市人民政府所有。</p>
                <p>8、在任何情况下，本网站合理地认为用户的行为可能违反法律、法规，本网站可以在任何时候，终止向该用户提供服务，并通知用户。</p>
            </div>
        )
    }
}

module.exports = APPagreement;